In [19]:
#pip install pandas

In [4]:
import pandas as pd

In [6]:
pd.__version__

'2.2.2'

## **SERIES**

In [9]:
s2=pd.Series(['kamali','khathija','Afra','Pratheeba','pudhu',],index=[1,2,3,4,5])

In [10]:
s2

1       kamali
2     khathija
3         Afra
4    Pratheeba
5        pudhu
dtype: object

In [11]:
s3=pd.Series(['No','No','Yes','yes','yes'],index=[1,2,3,4,5])

In [12]:
s3

1     No
2     No
3    Yes
4    yes
5    yes
dtype: object

## **DATA FRAME**

In [14]:
DF1=pd.DataFrame(s2,columns=['Name'])

In [15]:
DF1

        Name
1     kamali
2   khathija
3       Afra
4  Pratheeba
5      pudhu

In [16]:
Fruits={"seed":{1:"Orange",2:"Apple",3:"watermelon"},"Seedless":{1:"Grapes",2:"PineApple",3:"Papaya"}}

In [17]:
df2=pd.DataFrame(Fruits,columns=["seed","Seedless"])

In [18]:
df2

         seed   Seedless
1      Orange     Grapes
2       Apple  PineApple
3  watermelon     Papaya

***activity 1***

create dataframe for a class containning "Name", "Reg no", "Year of study" as column names for 05 students

In [26]:
Students={"Name":{1:"Kamali",2:"Khathija",3:"Afra",4:"Pratheeba",5:"pudhumalar",6:"Viji"},"Reg No":{1:"122011012803",2:"122011012817",3:"122011012820",4:"122011012821",5:"122011012840",6:"122011012836"},"Year of Study":{1:"IIIYr",2:"IIIYr",3:"IIIYr",4:"IIIYr",5:"IIIYr",6:"IIIYr"}}

In [27]:
df3=pd.DataFrame(Students,columns=["Name","Reg No","Year of Study"])

In [28]:
df3

         Name        Reg No Year of Study
1      Kamali  122011012803         IIIYr
2    Khathija  122011012817         IIIYr
3        Afra  122011012820         IIIYr
4   Pratheeba  122011012821         IIIYr
5  pudhumalar  122011012840         IIIYr
6        Viji  122011012836         IIIYr